Fro the shake of completeness, the described issue is not related with the provider. If a machine is managed both by Terraform and external automation or manual user actions, Terraform can enter into a weird state. For example, the below Terraform can compose a machine from a VM host:

```tf
resource "maas_vm_host_machine" "tf_test_vm" {
  cores   = 1
  memory  = 2048
  vm_host = 1
}

resource "maas_network_interface_link" "virsh_vm1_nic1" {
  machine = maas_vm_host_machine.tf_test_vm.id
  network_interface = "enp5s0"
  subnet            = "10.20.0.0/24"
  mode              = "STATIC"
  ip_address        = "10.20.0.97"
  default_gateway   = false
}
```

```bash
terraform apply -auto-approve

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # maas_network_interface_link.virsh_vm1_nic1 will be created
  + resource "maas_network_interface_link" "virsh_vm1_nic1" {
      + default_gateway   = false
      + id                = (known after apply)
      + ip_address        = "10.20.0.97"
      + machine           = (known after apply)
      + mode              = "STATIC"
      + network_interface = "enp5s0"
      + subnet            = "10.20.0.0/24"
    }

  # maas_vm_host_machine.tf_test_vm will be created
  + resource "maas_vm_host_machine" "tf_test_vm" {
      + cores    = 1
      + domain   = (known after apply)
      + hostname = (known after apply)
      + id       = (known after apply)
      + memory   = 2048
      + pool     = (known after apply)
      + vm_host  = "1"
      + zone     = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.
maas_vm_host_machine.tf_test_vm: Creating...
maas_vm_host_machine.tf_test_vm: Still creating... [10s elapsed]
maas_vm_host_machine.tf_test_vm: Still creating... [20s elapsed]
maas_vm_host_machine.tf_test_vm: Still creating... [30s elapsed]
maas_vm_host_machine.tf_test_vm: Still creating... [40s elapsed]
maas_vm_host_machine.tf_test_vm: Still creating... [50s elapsed]
maas_vm_host_machine.tf_test_vm: Still creating... [1m0s elapsed]
maas_vm_host_machine.tf_test_vm: Still creating... [1m10s elapsed]
maas_vm_host_machine.tf_test_vm: Still creating... [1m20s elapsed]
maas_vm_host_machine.tf_test_vm: Still creating... [1m30s elapsed]
maas_vm_host_machine.tf_test_vm: Still creating... [1m40s elapsed]
maas_vm_host_machine.tf_test_vm: Still creating... [1m50s elapsed]
maas_vm_host_machine.tf_test_vm: Still creating... [2m0s elapsed]
maas_vm_host_machine.tf_test_vm: Creation complete after 2m5s [id=d36efw]
maas_network_interface_link.virsh_vm1_nic1: Creating...
maas_network_interface_link.virsh_vm1_nic1: Creation complete after 2s [id=623]

Apply complete! Resources: 2 added, 0 changed, 0 destroyed.
```

If later on the machine is deployed outside Terraform and also the maas_network_interface_link is removed from the state, Terraform re-run will fail with the following error:

```bash
$ maas local machine read d36efw | jq -r .status_name
Ready
$ maas local machine deploy d36efw distro_series=ubuntu/jammy > /dev/null 2>&1
$ maas local machine read d36efw | jq -r .status_name
Deploying
$ maas local machine read d36efw | jq -r .status_name
Deployed
$ terraform state list
maas_network_interface_link.virsh_vm1_nic1
maas_vm_host_machine.tf_test_vm
$ terraform plan
maas_vm_host_machine.tf_test_vm: Refreshing state... [id=d36efw]
maas_network_interface_link.virsh_vm1_nic1: Refreshing state... [id=623]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration and found no differences, so no changes are needed.

$ terraform state rm maas_network_interface_link.virsh_vm1_nic1
Removed maas_network_interface_link.virsh_vm1_nic1
Successfully removed 1 resource instance(s).

$ terraform apply -auto-approve
maas_vm_host_machine.tf_test_vm: Refreshing state... [id=d36efw]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # maas_network_interface_link.virsh_vm1_nic1 will be created
  + resource "maas_network_interface_link" "virsh_vm1_nic1" {
      + default_gateway   = false
      + id                = (known after apply)
      + ip_address        = "10.20.0.97"
      + machine           = "d36efw"
      + mode              = "STATIC"
      + network_interface = "enp5s0"
      + subnet            = "10.20.0.0/24"
    }

Plan: 1 to add, 0 to change, 0 to destroy.
maas_network_interface_link.virsh_vm1_nic1: Creating...
╷
│ Error: ServerError: 409 Conflict (Cannot disconnect interface because the machine is not New, Ready, Allocated, or Broken.)
│ 
│   with maas_network_interface_link.virsh_vm1_nic1,
│   on bug-customer.tf line 7, in resource "maas_network_interface_link" "virsh_vm1_nic1":
│    7: resource "maas_network_interface_link" "virsh_vm1_nic1" {
│ 
╵
```

What would work in your case would be to use the `maas_instance` to manage deployments with Terraform and since you care only for STATIC IP assignments use the `network_interfaces.ip_address` [field](https://registry.terraform.io/providers/canonical/maas/latest/docs/resources/instance#ip_address-1). By doing so, Terraform will become aware of the machine status and will try to redeploy it if the IP assignment changes or do nothing if the IP assignment remains the same.

Thank you for reporting the issue. I think based on the above, it is ok to resolve it.